window.HANDBOOK_DOCUMENTS = window.HANDBOOK_DOCUMENTS || {};
window.HANDBOOK_DOCUMENTS["195a2da9f81477eaf02e"] = {
  "id": "195a2da9f81477eaf02e",
  "title": "文字.txt",
  "treatment": "代码或文本参考",
  "sections": [
    {
      "title": "文字.txt",
      "level": 1,
      "blocks": [
        {
          "type": "text",
          "language": "",
          "text": "美团前端开发-到综商家 15-20K·15薪\n\n上海.1-3年.学历不限\n\n\n\n   一、职位描述\n\n    1、负责前期页面的搭建\n\n    2、负责重点项目的前端技术方案和架构的研发和维护工作\n\n    3、参与或主导团队内部重要技术项目的规划及落地\n\n\n\n    二、岗位要求\n\n    1、技术栈：对React/Vue、Webpack、组件库、动静分离，ESLint有深入的理解\n\n      2、公共能力：有丰富的 Web\n\n      标准、易用性、浏览器端原理、网站性能优化以及网络等方面的知识\n\n    3、实战：对于业务需求有一定抽象能力，并且定期对自己工作进行复盘总结  \n\n      4、合作：善于交流，有良好的团队合作精神和协调沟通能力，有与产品、后端、QA等多方密切配合的经验和意识\n\n    \n\n    三、具备以下者优先\n\n    1、有大型后台系统的研发经验，尤其是B端系统\n\n    2、心态开放，有主动进取心，有较强的自我要求\n\n    3、热爱互联网和新技术，跟进研究前端业界的前沿理念和技术实践\n\n\n\n    四、福利待遇\n\n    五险一金\n\n    补充公积金\n\n    年终奖\n\n    弹性工作制\n\n    定期体检\n\n    免费小零食、咖啡\n\n\n\n    五、工作地址\n\n    上海长宁区申亚时代广场B座"
        }
      ]
    }
  ]
};
