window.HANDBOOK_DOCUMENTS = window.HANDBOOK_DOCUMENTS || {};
window.HANDBOOK_DOCUMENTS["83f073a4870c7f90e6ca"] = {
  "id": "83f073a4870c7f90e6ca",
  "title": "js基础第四天.xmind",
  "treatment": "思维导图主题树",
  "sections": [
    {
      "title": "主题树",
      "level": 1,
      "blocks": [
        {
          "type": "text",
          "text": "JS基础\nJS基础第四天函数\nday04(函数)\n目标：理解封装的意义，能够具备封装函数的能力\n什么是函数?为什么需要函数?\n函数可以理解为一个 特定的代码块 容器 ，它可以完成特定的需求, 并且可以 重复 使用\n需求: 让99乘法表重复使用 ?\n函数声明和函数调用\n函数默认不会主动执行,必须通过函数名() 调用才会执行. \n函数一次声明可以多次调用,每一次函数调用函数体里面的代码会重新执行一次.\n我们曾经使用的 alert() , parseInt() 这种名字后面跟小括号的本质都是函数的调用 \n思考小问题: 函数的复用和循环的重复有什么不同?\n小练习\n 封装一个打招呼的函数\n 封装一个函数，计算两个数的和\n 封装一个函数，计算1-100之间所有数的和\n问: 这些函数有什么缺陷\n函数传参\n根据上面练习的缺陷引出函数传参\n把函数在复用过程中会改变的值提取出来, 作为参数传递进去.这样可以极大提高函数的灵活性\n需求: 封装一个可以跟任何人打招呼的函数\n函数传参的语法\n完成上述需求\n形参\n函数声明的时候，小括号里面的是形参\n形式上的参数\n相当于变量\n作用: 接受传递过来的实参\n如果没有实参传递过来默认是 undefined\n实参\n实际的参数\n函数调用的时候，小括号里面的参数\n可以是变量\n参数默认值\n形参的默认值是 undefined\nfunction fn(x = 0, y = 0) {}\n细节说明\n1. 术语1: 在声明函数的小括号里面写的数值我们称之为形式参数\n2. 术语2: 在调用函数的小括号里面写的数值我们称之为实际参数\n3. 形参作用: 本质上就是在函数内部声明变量\n4. 实参作用: 给形参赋值\n5. 我们曾经使用过的 alert('打印'), parseInt('11'), Number('11') 本质上都是函数调用的传参\n练习\n1. 计算1-n之间所有数的和\n2. 计算m-n之间所有数的和 \n3. 学生的分数是一个数组,计算每个学生的总分 \n函数的返回值\n我们使用过的返回值引出为什么需要返回值\n使用过的返回值\nlet result = prompt('请输入你的年龄?');\t\t\nlet result2 = confirm('你确定要删除这条记录么?')\nlet result3 = parseInt('111');\n// 函数的返回值不是必须的, 比如: alert() \n\nlet result4 = alert('弹出一个内容');\n上面都是我们使用过的函数返回值的情况. 只是这些函数是JS底层内置的.我们直接就可以使用\n引出我们自己自定义的函数如何拥有返回值\n介绍语法\nfunction doSomething(){\n\n    // doing\n\n    return result;\n\n}\n\n\n\nlet jieguo = doSomething();\n场景介绍\nreturn result 和 console.log(result)的区别 ???\n调用两次求和函数,得到每一次求和的结果,再比较这两个结果的大小\nfunction getSum(a, b) {\n\n  let sum = a + b;\n\n  return sum;\n\n}\n\n\n\nlet sum1 = getSum(10, 20);\n\nlet sum2 = getSum(5, 16);\n\n\n\nlet max = sum1 > sum2 ? sum1 : sum2;\n\nconsole.log(max);\n返回值练习 \n根据下面的模板, 计算不同学生的总成绩(将每科成绩累加), 并求出当中的最高分\n// 声明\n\nfunction getScore(arr) { \n\n}\n\n\n\n// 张三的分数数组\n\ngetScore([100, 90, 85]);\n\n// 李四的分数数组\n\ngetScore([95, 92, 89]);\n\n// 王五的分数数组\n\ngetScore([69, 100, 100]);\n综合练习\n1. 求任意数组中的最大值并返回这个最大值\n2. 求任意数组中的最小值并返回这个最小值\n3. 求任意2个数中的最大值, 并返回\n断点调试\nf11进入函数内部\n细节补充\n两个相同的函数后面的会覆盖前面的函数\n在Javascript中 实参的个数和形参的个数可以不一致\n如果形参过多 会自动填上undefined (了解即可)\n如果实参过多 那么多余的实参会被忽略 (函数内部有一个arguments,里面装着所有的实参)\n函数一旦碰到return就不会在往下执行了  函数的结束用return\n1. 思考: break的结束和return结束有什么区别 ?\n2. 思考: 如何返回多个数据 ?\n作用域\n什么是作用域? 为什么要了解作用域\n准备好一个变量在不同的情况下,取值不同的问题例子作为开场\n作用域分类\n全局作用域:\n函数作用域\n变量访问原则\n在能够访问到的情况下 先局部 局部没有在找全局\n匿名函数\n没有名字的函数, 无法直接使用\n使用方式\n将匿名函数赋值给一个变量，并且通过变量名称进行调用 我们将这个称为函数表达式\n自执行（匿名函数自执行）\n场景介绍: 避免全局变量之间的污染\n综合案例"
        }
      ]
    }
  ]
};
