window.HANDBOOK_DOCUMENTS = window.HANDBOOK_DOCUMENTS || {};
window.HANDBOOK_DOCUMENTS["85782e24c0548769088d"] = {
  "id": "85782e24c0548769088d",
  "title": "js基础第一天.xmind",
  "treatment": "思维导图主题树",
  "sections": [
    {
      "title": "主题树",
      "level": 1,
      "blocks": [
        {
          "type": "text",
          "text": "JS基础\nday01(基础语法)\n目标：理解变量、数据类型、等基础概念，能够实现数据类型的转换，具备利用模板字符串渲染表格的能力\njs简介\nJS的简介\n对JS有一个宏观的理解\n概念\nJavaScript 是一种运行在客户端（浏览器）的编程语言\n作用\n1. 网页特效 (监听用户的一些行为让网页作出对应的反馈)\n2. 表单验证 (针对表单数据的合法性进行判断)\n3. 数据交互 (获取后台的数据, 渲染到前端)\n4. 服务端编程 (node.js)\n组成\nECMAscript\nDOM\nBOM\n初体验\n快速感知JS\n案例引入\ntab栏切换案例\n引入案例的目的： 让学生明白html+css+js如何进行相互交互合作做效果\nJS的注释\n//\n/*  */\n分号规范\n要么都写\n要么都不写\n听老大的\nscript标签的位置\n外部式\n中间不要写代码\n内部式\n写到 /body上方\n内联式\n输入输出语法\n语法\n人和计算机打交道的规则约定\n我们要按照这个规则去写\n你吃了吗\n我们程序员需要操控计算机，需要计算机能看懂\n输入语法\nprompt\n输出语法\n基于后续课程演示的需要\nalert\nconsole.log\ndocument.write\njs代码执行顺序\n案例练习： \n字面量\n在计算机科学中，字面量（literal）是在计算机中描述事/物\n123\n是数字字面量\n'黑马程序员'  字符串字面量\n[] 数组字面量\n变量\n学会使用变量\n概念和作用\n容器\n声明赋值的几种写法\n先声明,再赋值\nlet age\n声明并直接赋值\nlet age = 18\n同时声明多个变量\nlet age = 18, uname = 'andy'\n不提倡\n练习\n文字形式描述\n声明一个变量，用于存放用户购买的商品数量为20件\n声明一个变量，用于存放用户的姓名为\"张三\"\n案例：\n交换两个变量\n变量的本质\n在内存中开辟一个空间\n命名规则和规范\n规则\n由字母、数字、下划线、$符号组成，不能以数字开头\n不能是关键字和保留字，例如：var for while const\n严格区分大小写\n规范\n变量名必须有意义\n遵守小驼峰式命名法 \n大厂面试题\n拓展数组\n什么是数组? 为什么需要数组?\n存储班级所有人的姓名\n数组可以单个变量存储多个数据\n创建数组\nlet arr = [10,29,80]\n取值\n数组[下标]\narr[2]    === 80\n常量\n常量的值是无法改变的，也不能被重新声明\n和变量一致\n用法\nconst G = 9.8\n不重新赋值的数据使用const\n数据类型\n1. 更加充分和高效的利用内存\n2. 也更加方便程序员的使用数据\n分类介绍\n基本数据类型\n- number 数值型\n- string 字符串\n单引号\n双引号\n反引号\n字符串拼接\n'+ 变量名 +' 去替换需要替换的内容\n有拼接不方便引申出模板字符串\n模板字符串(ES6) \n页面弹出对话框，输入名字和年龄，页面显示： 大家好，我叫xxx，今年xx岁了\n- boolean 布尔型\n- undefined 未定义\n声明一个变量没有赋值\n- null 空引用\n将来存放对象的时候可以给null\n引用数据类型\n- object  对象\n- function  函数 \n- array    数组\n数据类型的转换\n为什么需要转换?\n从用户得到的数据都是字符串,而字符串和数字相加会变成相连\n显示转换\n转换成数字\nNumber()\nparse系列\n如果介绍parse系列就是介绍区别和使用场景\n三者的区别\n案例\n加法器：页面输入2个数，计算两者的和，打印到页面中\n转换成字符串\nString()\n变量.toString() \n括号里面可以跟进制\n两者区别\n隐式转换的小技巧\n+号作为正号解析可以转换成Number\n任何数据和字符串相加结果都是字符串\n算术运算符\n加、减、乘、除、取模 (+, -, *, /, %)\n加号上下文\n如果+号左右只有一个值  解析的结果是正号 可用于隐式转换\n如果两边都是数值(Number)类型 则是+号运算符\n+号的左右如果有一个数据是字符串数据类型的话  那么这个+号会被解析成连接符\n优先级\n对话框中输入圆的半径，算出圆的面积并显示到页面\n收尾案例\n计算数额案例"
        }
      ]
    }
  ]
};
