window.HANDBOOK_DOCUMENTS = window.HANDBOOK_DOCUMENTS || {};
window.HANDBOOK_DOCUMENTS["bddadf6500719af07031"] = {
  "id": "bddadf6500719af07031",
  "title": "js基础第五天.xmind",
  "treatment": "思维导图主题树",
  "sections": [
    {
      "title": "主题树",
      "level": 1,
      "blocks": [
        {
          "type": "text",
          "text": "JS基础\nJS基础第五天\nday05(对象)\n目标：知道对象数据类型的特征，具备对象数组数据渲染页面的能力。\n什么是对象? 为什么需要对象?\n何为对象：万物皆对象,对现实事物的描述。客观世界中的具体的实体都是对象 如一个人,一个气球,一辆汽车,咱们的 班主任等.\n需求: 如何在JS中存储班主任这个对象的信息 ?\n- 静态特征 (姓名, 年龄, 身高, 性别, 爱好) => 可以使用数字, 字符串, 数组, 布尔类型等表示\n- 动态行为 (点名, 唱, 跳, rap) => 使用函数表示\n对象是一种数据类型\n对象组成\n属性\n方法\n对象的基本语法介绍\n在Js中, 对象就是一组无序的键值对的集合\n说明\n1. 我们把冒号左边的内容称之为属性, 右边称之为值, 成对出现, 故称之为键值对\n2. 当右边的值为函数的时候, 我们更喜欢将这个属性称之为方法\n3. 对象本质上也是一种数据集合, 对比数组来说它里面装的都是不同类型的数据, 并且有对应的属性提示数据的含义\n提问: 上述信息是否可以使用数组存储\n对象的基本使用\n对象本质上也是数据集合,使用无外乎增删改查\n查语法: 对象名.属性\n改语法: 对象名.属性 = 新值\n增语法: 对象名.新属性名 = 新值\n删语法（一嘴带过）\ndelete 对象名.属性名\n对象遍历\n引入[]语法操作对象属性\n对比点语法的相同点和不同点\n1. 都可以访问对象的属性 对象名.属性名 === 对象名['属性名']\n2. []语法里面的值如果不添加引号 默认会当成变量解析\n3. 没有必要的时候直接使用点语法, 在需要解析变量的时候使用 [] 语法\n遍历对象\nfor 遍历对象的问题：\n对象没有像数组一样的length属性,所以无法确定长度\n对象里面是无序的键值对, 没有规律. 不像数组里面有规律的下标\n通过for in 语法\n1. for in语法中的 attr 是一个变量, 在循环的过程中依次代表对象的属性名\n2. 由于attr是变量, 所以必须使用 [ ] 语法解析 \nk输出的是 属性名\nobj[k] 属性值\n综合案例\n内置对象\n什么是内置对象？ 为什么要学习内置对象\nMath\n  Math.PI\n最大值/最小值\n绝对值\n取整\n随机数\n求 0 -n之间的随机数\n求m-n之间的随机数\n练习： 随机抽奖 / 猜数字游戏\n学成在线页面渲染案例\n简单类型和复杂类型\n堆和栈\n简单数据类型存储方式\n复杂数据类型存储方式"
        }
      ]
    }
  ]
};
