window.HANDBOOK_DOCUMENTS = window.HANDBOOK_DOCUMENTS || {};
window.HANDBOOK_DOCUMENTS["c40cc402af1ad8556205"] = {
  "id": "c40cc402af1ad8556205",
  "title": "js基础第二天.xmind",
  "treatment": "思维导图主题树",
  "sections": [
    {
      "title": "主题树",
      "level": 1,
      "blocks": [
        {
          "type": "text",
          "text": "JS基础\nJS基础第二天\nday02(流程控制)\n理解什么是流程控制，知道条件控制的种类并掌握其对应的语法规则，具备利用循环编写简易ATM取款机程序能力\n运算符\n赋值运算符 (=)\n将等号右边的值赋予给左边, 要求左边必须是一个容器\n累加 +=\n一元运算符\n一元运算符: 仅操作一个操作数. 比如: 正负号等 \n自增自减运算符 \n相同点\n不管是++或者-- 是在前还是在后,都是在原来的取值上自行增1或减1  类似于 => a += 1\n不同点\n符号前置 => 先加1 再使用 (快捷记忆: ++在前 先加)\n符号后置 => 先使用 再加1 (快捷记忆: ++在后, 后加)\n面试题\n逻辑运算符\n逻辑与\n逻辑或\n逻辑非\n比较运算符\n > , < , >= , <= , == , === , != , !==\n重点介绍 等于和全等的区别, 推荐使用全等\n特殊说明\n如果是数字和\"其他值\"的比较 则其他值会自动转换成数字去比较\n涉及到\"NAN\"都是false （NaN）\n如果是\"字符串\"和\"字符串\"比较 则会比较每一个字符的ASCII码,同时是按位进行比较 \n如果是布尔值参与比较 布尔值会转换成数字0和1\n运算符优先级\n语句\n表达式和语句\n表达式\n表达式是一组代码的集合，JavaScript解释器会将其计算出一个结果\nx = 7\n3 + 4\nnum++\njs 整句或命令，js 语句是以分号结束（可以省略）\nif 条件语句\nfor 循环语句\n区别\n达式计算出一个值，但语句用来自行以使某件事发生。\n表达式  3 + 4 \n语句  alert()  弹出对话框\n语句分类\n顺序语句\n分支语句\n循环语句\nif分支\n单条分支\n案例\n用户输入高考成绩，如果分数大于700，则提示恭喜考入黑马程序员\n双分支\n1.用户输入，如果工龄大于1年，年底奖金+2000， 否则年底没奖金\n2.让用户输入年份，判断这一年是闰年还是平年并输出\n多条分支\n根据输入不同时间，输出不同的问候语\n作业--输入分数，根据分数奖励不同的车(评级)\n三元运算符\n条件 ? 表达式1 : 表达式2\n对比if两条分支的区别\n练习案例\n两个数的最大值\n数字补0案例\n09\nswitch case\n出现定值判断使用\n特点说明\n1. switch case语句一般用于等值判断,不适合于区间判断\n2. switch case比较的值全等 ===\n3. switch case一般需要配合break关键字使用 没有break会造成case穿透\n简单加法器\n分支语句的综合\nif 分支\n 使用的最多的分支语句  任何情况下都可以通用\n三元运算\n可以简单理解为两条分支的简写形式,一些简单的两条分支可以使用三元运算符代替\n相较正常的两条分支语句来说多了一个返回值\nswitch case语句\n当出现了定值判断的时候可以使用\n多分支语句和switch的区别\n如果值比较精确用switch ，效率更高\n如果有范围的判断，用多分支语句\n断点调试\n是为了演示循环语句的过程\nwhile循环\n语法\n练习\n- 打印1-100以内 所有偶数\n- 打印1-100的和\n- 打印1-100以内所有偶数的和\nwhile的使用场景介绍\n更适合使用在循环的次数不确定时候使用\n询问“我爱你，嫁给我吧？”，如果输入为“嫁” 跳出循环打印 “我们形影不离”，否则一直询问\n让用户输入用户名和密码，只有当用户名=admin并且用户密码=123456的时候才提示登录成功（跳出循环），否则一直让用户输入\nwhile (true) {\n\n  if (条件) {\n\n    break;\n\n  }\n\n}\n\n// break: 可以用来跳出循环\nbreak和continue\nbreak退出整个循环\ncontinue退出本次循环，继续下一次循环\ndo while 循环(课下了解)\n综合案例\n存钱取钱案例"
        }
      ]
    }
  ]
};
