window.HANDBOOK_DOCUMENTS = window.HANDBOOK_DOCUMENTS || {};
window.HANDBOOK_DOCUMENTS["e303f7a4088b3f789c8b"] = {
  "id": "e303f7a4088b3f789c8b",
  "title": "js基础第三天.xmind",
  "treatment": "思维导图主题树",
  "sections": [
    {
      "title": "主题树",
      "level": 1,
      "blocks": [
        {
          "type": "text",
          "text": "JS基础\nday03(数组)\n知道什么是数组及其应用的场景，掌握数组声明及访问的语法，具备利用数组渲染柱形图表的能力\nfor循环\n根据while练习的四要素引入for循环\n1. 循环变量初始值\n2. 循环的条件\n3. 循环体\n4. 循环变量自增自减运算\n练习\n- 打印1-100的和\n- 打印1-100以内所有偶数的和\nfor循环开发中常见的作用是循环数组\n案例： 打印班级名单案例\n遍历数组\n循环的小结\n for循环: 当如果明确了循环的次数的时候推荐使用for循环\n while循环: 当不明确循环的次数的时候推荐使用while循环\n循环语句的跳出\nbreak和continue\n说明区别\n1. break: 一般用于结果已经得到, 后续的循环不需要的时候可以使用\n2. continue: 一般用于排除或者跳过某一个选项的时候, 可以使用continue\n循环加强\n双层for循环嵌套\n在网页上打印出一个五行五列的星星\n在网页上打印出一个五行递增列的星星\n在网页上打印99乘法表\n数组\n什么是数组? 为什么需要数组?\n存储班级所有人的姓名\n可以把多个数据存储到单个变量里面\n创建数组\n字面量\n构造函数(提一嘴)\n操作数组\n数组本质是数据集合,使用无非就是增删改查\n查\n数组[下标]\n改\n数组[下标] = 新值\n增\narr.push(新增的内容)\npush可以实现一次性添加多个的效果, 推荐使用\narr.unshift(新增的内容)\n删\narr.pop()\n每次只能删除一个，删末尾的\narr.shift()\n每次只能删除一个，删开头的\narr.splice(操作的下标,删除的个数)\n访问数组里面的每一个数据 \n依次访问\n循环访问 for \n数组中的元素  arr[i]\n遍历数组的练习\n求一组数中的所有数的和及其平均值\n要求将数组中的0项去掉，将不为0的的值存入到新的数组 生成新的数组\n求一组数中的最大值和最小值 以及所在位置\n冒泡排序\n综合案例-输入数据生成柱形图"
        }
      ]
    }
  ]
};
